export const difficultyDescriptions = {
	1: "Дуже легко - мінімальна затратність часу",
	2: "Легко - кероване навантаження",
	3: "Помірно - стандартна складність",
	4: "Складно - потребує додаткових зусиль",
	5: "Дуже складно - забирає значно більше часу, ніж варто за кредити",
} as const;

export const usefulnessDescriptions = {
	1: "Не корисно - жодної користі не отримано",
	2: "Трохи корисно - мінімальна користь",
	3: "Достатньо корисно - помірна цінність",
	4: "Дуже корисно - значна користь",
	5: "Надзвичайно корисно - необхідно для кар'єри/навчання",
} as const;

export const CANNOT_RATE_TOOLTIP_TEXT =
	"Ви зможете оцінити курс, коли він розпочнеться";
